src/Documents/ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам</Name>
			<Comment>Фиксация результатов инвентаризаций по продавцам (ИТ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИТ_ВзаиморасчетыСПродавцами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИТ_ПакетДокументовРезультатовИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинейныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемыйИсточникУдержания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИТ_ПланируемыеИсточникиУдержаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодУдержания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксацияОснование</Name>
					<Comment>Документ фиксации, на основании которой сделан текущий</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыИнвентаризаций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументИнвентаризации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКУдержанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипУдержания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИТ_ТипыУдержанийПоРезультатамИнвентаризаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетФиксацияРезультатовПоПродавцам(Команда)
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		Сообщить("Документ не проведён! Невозможно сформировать отчёт!");
		Возврат;
	КонецЕсли;
	
	ПериодДляОтчета = Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод);
	ПериодДляОтчета.ДатаНачала		= НачалоДня(Объект.Дата);
	ПериодДляОтчета.ДатаОкончания	= КонецДня(Объект.Дата);
	
	СписокДокументов = Новый СписокЗначений;
	СписокДокументов.Добавить(Объект.Ссылка);
	
	НомерДокумента			= ПолучитьНомерНаПечатьНаСервере(Объект.Номер);
	ТекущийДокументСтрокой	= "Фиксация результатов инвентаризаций по продавцам № " + (НомерДокумента) + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("ДокументыФиксации",		СписокДокументов);
	СтруктураОтбора.Вставить("ПериодОтчета",			ПериодДляОтчета);
	СтруктураОтбора.Вставить("ДокументФиксацияСтрокой",	ТекущийДокументСтрокой);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОтборОтчета",					СтруктураОтбора);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",		Истина);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",	Новый ПользовательскиеНастройкиКомпоновкиДанных);
	
	ОткрытьФорму("Отчет.ИТ_ОтчетФиксацияРезультатовИнвентаризацииПоПродавцам.ФормаОбъекта", ПараметрыФормы);
	//ОтчетыПлатформаКлиент.ОткрытьОтчет(
	//	"Отчет.ИТ_ОтчетФиксацияРезультатовИнвентаризацииПоПродавцам",
	//	"Основной",,,,
	//	СтруктураОтбора);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерНаПечатьНаСервере(Номер)	
	Возврат ПрефиксацияОбъектовПлатформа.ПолучитьНомерНаПечать(Номер);
КонецФункции

&НаКлиенте
Процедура ПеренестиВДругуюФиксациюСДругимПланируемымИсточникомУдержания(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Сначала необходимо записать документ!");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Выделенные строки будут перенесены в новый док-т фиксации! Продолжить?", Режим);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	НовыйПланируемыйИсточникУдержания = Объект.ПланируемыйИсточникУдержания;
	Если ВвестиЗначение(НовыйПланируемыйИсточникУдержания) Тогда
		
		Если НовыйПланируемыйИсточникУдержания <> Неопределено
			И НовыйПланируемыйИсточникУдержания <> Объект.ПланируемыйИсточникУдержания Тогда
			ПеренестиВДругуюФиксациюСДругимПланируемымИсточникомУдержанияНаСервере(НовыйПланируемыйИсточникУдержания);
			ЗаполнениеРезультатовИнвентаризаций();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнениеРезультатовИнвентаризаций()
	
	//Для Каждого СтрокаДокумента Из Объект.РезультатыИнвентаризаций Цикл
	//	СтрокаДокумента.РезультатИнвентаризации = ИТ_СпециальныйМодульСервер.ПолучитьРезультатИнвентаризации(СтрокаДокумента.ДокументИнвентаризации);	
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиВДругуюФиксациюСДругимПланируемымИсточникомУдержанияНаСервере(НовыйПланируемыйИсточникУдержания)
	
	МассивВыделенныхСтрок = Элементы.РезультатыИнвентаризаций.ВыделенныеСтроки;
	
	СписокПродавцов = "";
	Зпт				= "";
	Для Каждого ИндексСтроки Из Элементы.РезультатыИнвентаризаций.ВыделенныеСтроки Цикл
		вСтрока = Объект.РезультатыИнвентаризаций.НайтиПоИдентификатору(ИндексСтроки);
		
		СписокПродавцов = СписокПродавцов + Зпт + Строка(вСтрока.Продавец);
		Зпт = ", ";
	КонецЦикла;

	ТекущаяФиксацияСсылка	= Объект.Ссылка;
	ТекущаяФиксация			= Объект.Ссылка.ПолучитьОбъект();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам.Ссылка
		|ИЗ
		|	Документ.ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам КАК ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам
		|ГДЕ
		|	ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам.Проведен
		|	И ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам.ФиксацияОснование = &ФиксацияОснование";
	
	Запрос.УстановитьПараметр("ФиксацияОснование", ТекущаяФиксацияСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НайденнаяФиксация = Документы.ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам.ПустаяСсылка();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НайденнаяФиксация = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если НайденнаяФиксация = Документы.ИТ_ФиксацияРезультатовИнвентаризацииПоПродавцам.ПустаяСсылка() Тогда
		
		НоваяФиксация = ТекущаяФиксация.Скопировать();
		
		НоваяФиксация.ПланируемыйИсточникУдержания	= НовыйПланируемыйИсточникУдержания;
		НоваяФиксация.ФиксацияОснование				= ТекущаяФиксацияСсылка;
		НоваяФиксация.Дата							= ТекущаяДата();
		
		НоваяФиксация.Комментарий = НоваяФиксация.Комментарий + ". Строка(и) перенесена(ы) из документа " + Строка(ТекущаяФиксацияСсылка);
		
		КонечныйИндекс = НоваяФиксация.РезультатыИнвентаризаций.Количество() - 1;
		Пока КонечныйИндекс >= 0 Цикл
			
			НайденныйИндексСтроки = МассивВыделенныхСтрок.Найти(КонечныйИндекс);
			Если НайденныйИндексСтроки = Неопределено Тогда
				НоваяФиксация.РезультатыИнвентаризаций.Удалить(КонечныйИндекс);
			КонецЕсли;
			
			КонечныйИндекс = КонечныйИндекс - 1;
			
		КонецЦикла;
	Иначе
		//Добавляем продавцов в созданную фиксацию
		НоваяФиксация = НайденнаяФиксация.ПолучитьОбъект();
		
		Для Каждого ИндексСтроки Из МассивВыделенныхСтрок Цикл
			
			СтрокаДокумента = Объект.РезультатыИнвентаризаций[ИндексСтроки - 1];
			
			НоваяСтрока = НоваяФиксация.РезультатыИнвентаризаций.Добавить();
			НоваяСтрока.Продавец				= СтрокаДокумента.Продавец;
			НоваяСтрока.ДокументИнвентаризации	= СтрокаДокумента.ДокументИнвентаризации;
			НоваяСтрока.Магазин                 = СтрокаДокумента.Магазин;
			НоваяСтрока.СуммаКУдержанию         = СтрокаДокумента.СуммаКУдержанию;
			НоваяСтрока.ТипУдержания			= СтрокаДокумента.ТипУдержания;
			
		КонецЦикла;
	КонецЕсли;

	КонечныйИндекс = ТекущаяФиксация.РезультатыИнвентаризаций.Количество() - 1;
	Пока КонечныйИндекс >= 0 Цикл
		
		НайденныйИндексСтроки = МассивВыделенныхСтрок.Найти(КонечныйИндекс);
		Если НайденныйИндексСтроки <> Неопределено Тогда
			ТекущаяФиксация.РезультатыИнвентаризаций.Удалить(КонечныйИндекс);
		КонецЕсли;
		
		КонечныйИндекс = КонечныйИндекс - 1;
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		НоваяФиксация.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Сообщить("Не удалось провести " + Строка(НоваяФиксация) + ". " + ТекстОшибки);	
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Если ЗначениеЗаполнено(НоваяФиксация.Ссылка) Тогда
		ТекущаяФиксация.Комментарий = ТекущаяФиксация.Комментарий + Символы.ПС + "Строка(и) продавца(ов) " + 
		СписокПродавцов + " перенесены в документ " + Строка(НоваяФиксация.Ссылка);
		Попытка
			ТекущаяФиксация.Записать(РежимЗаписиДокумента.Проведение);
			ЗафиксироватьТранзакцию();
			Сообщить("Данные перенесены.");
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Сообщить("Не удалось провести " + Строка(ТекущаяФиксацияСсылка) + ". " + ТекстОшибки);	
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти //СлужебныеПроцедурыИФункции
